rheoTool/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletWest
    {
	type            fixedValue;
	value           uniform 0;  
    }
    
    inletNorth
    {
	type            fixedValue;
	value           uniform 0; 
    }
    
    outlet
    {
	type            fixedValue;
	value           uniform 0;     
    }
    
    symmetry
    {
	type            symmetryPlane;    
    }
    
    walls
    {
	type            zeroGradient;
    }
}

// ************************************************************************* //
