rheoTool/tutorials/rheoEFoam/EKmixer/slipSmoluchowski/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue C 0
);

regions
(
    boxToCell
    {
        box (-1500e-6 0 0) (-50e-6 50e-6 50e-6);
        fieldValues
        (
            volScalarFieldValue C 1
        ); 
    }
);

// ************************************************************************* //
